app/controllers/movies_controller.rb

	def index
		@movie = Movie.all
---
SELECT  "movies".* FROM "movies" LIMIT ?  [["LIMIT", 1]]